In [34]:
import pandas as pd
import numpy as ny
import matplotlib as mat
from sqlalchemy import create_engine
import datetime
import seaborn as sea

## Energy Transfer Stock Data

In [36]:
# create an engine to connect to the database
# replace "username", "password", "host", "port", and "database_name" with your own values
engine = create_engine('postgresql://postgres:dJj135790@localhost:5432/stocks')

# test the connection by executing a query
result = engine.execute("SELECT version()")
row = result.fetchone()
print("PostgreSQL version:", row[0])

PostgreSQL version: PostgreSQL 14.7, compiled by Visual C++ build 1914, 64-bit

In [37]:
et =pd.read_csv("./ET.csv")
et.shape

(252, 7)

In [38]:
et.head()

          ymd   open   high    low  close  adjusted    volume
0  2022-03-01  10.19  10.46  10.19  10.42  9.591922  26127000
1  2022-03-02  10.51  10.55  10.39  10.49  9.656359  25149600
2  2022-03-03  10.45  10.47  10.24  10.37  9.545896  19441100
3  2022-03-04  10.38  10.46  10.27  10.43  9.601129  15828600
4  2022-03-07  10.58  10.59  10.21  10.34  9.518280  26783500

In [ ]:
""" # assume df is a pandas DataFrame containing a column named 'ymd' with dates in string format
et['ymd'] = pd.to_datetime(et['ymd'], format='%Y-%m-%d', errors='coerce')

# check for invalid date formats
num_invalid_dates = et['ymd'].isna().sum()

if num_invalid_dates > 0:
    print(f'Warning: {num_invalid_dates} invalid dates found in ymd column')

# extract date component from datetime and convert to date type
et['ymd'] = et['ymd'].dt.date

# print the first 5 rows of the DataFrame to verify that the conversion worked
print(et.head())
 """

#### Write data to stock database w/o creating table first

In [39]:
# assume df is a pandas DataFrame containing the data to be written to the database
table_name = 'ET'
et.to_sql(table_name, engine, if_exists='replace', index=False)

252

In [41]:
# specify the SQL query to run
query = 'SELECT * FROM public."ET";'

# execute the query and store the results in a DataFrame
df = pd.read_sql_query(query, engine)
df.head()

          ymd   open   high    low  close  adjusted    volume
0  2022-03-01  10.19  10.46  10.19  10.42  9.591922  26127000
1  2022-03-02  10.51  10.55  10.39  10.49  9.656359  25149600
2  2022-03-03  10.45  10.47  10.24  10.37  9.545896  19441100
3  2022-03-04  10.38  10.46  10.27  10.43  9.601129  15828600
4  2022-03-07  10.58  10.59  10.21  10.34  9.518280  26783500